<template>
    <div class="about">
        <div class="header__mini">
            <div class="header__mini_wrapper">
                <div class="header__mini_title">О нас</div>
                <div class="header__mini_list">
                    <router-link :to="{ name: 'index' }" class="header__mini_item">Главная ></router-link>
                    <div class="header__mini_item header__mini_item-active">О нас</div>
                </div>
            </div>
        </div>
        <div class="about__top">
            <div class="about__left">
                <img src="/static/img/about123.png" alt="cover">
            </div>
            <div class="about__right">
                <div class="about__right_title">О нашей пекарне</div>
                <div class="about__right_desc">Пекарня «Всё о пирогах»  — это специализированная компания, выпекающая осетинские пироги по традиционной и оригинальной рецептуре, в полном соответствии с современными технологиями и установленными стандартами, с соблюдением контроля за изготовлением продукции и обеспечением ассортимента.В штате фирмы трудятся настоящие мастера своего дела, которые имеют большой опыт в создании шедевров под названием «осетинские пироги». Пекарня «Всё о пирогах» соответствует всем санитарно-гигиеническим требованиям Роспотребнадзора, нормам пожарной и электробезопасности, правилам безопасности труда. При кулинарной обработке пищевых продуктов неукоснительно соблюдаются СанПиН 2.3.2.1078-01 (Санитарные правила и нормы) — санитарно-эпидемиологические требования к технологическим процессам приготовления блюд.</div>
            </div>
        </div>
        <div class="about__center">
            <div class="about__center__wrapper">
                <div class="about__center_title">Любимые осетинские пироги</div>
                <div class="about__center_desc">это традиционное кавказское блюдо, популярность которого давно и далеко шагнула за пределы Кавказа.</div>
            </div>
        </div>
        <div class="about__slider">
            <div class="about__slider_wrapper">
                <swiper :options="swiperOption">
                    <swiper-slide>
                        <div class="about__slider_left">
                            <div class="about__slider_desc">С учетом Ваших пожеланий и отзывов наши мастера постоянно работают над улучшением рецептуры и расширением ассортимента осетинских блюд нашей фабрики пирогов. На сегодняшний день в перечне Вы найдете пироги с разнообразнейшими начинками, выбор которых ограничивается лишь Вашими пожеланиями и кулинарными предпочтениями. Многообразие вариантов начинки позволяет постоянно получать новое уникальное блюдо, как для повседневной, так и для праздничной трапезы.</div>
                        </div>
                        <div class="about__slider_right">
                            Почему пекарня «Всё о пирогах» лучшая в Москве? Потому что именно здесь можно приобрести самые вкусные осетинские пироги. Наши пироги готовятся только вручную, со строгим соблюдением старинных, проверенных временем рецептов, но главное – с душой и теплом, что и придает им неповторимый вкус. Для Вас мы печем наши традиционные пироги как для себя и своих детей. Попробуйте и убедитесь! При необходимости в пекарне Вы можете заказать и ряд других блюд.
                        </div>
                    </swiper-slide><swiper-slide>
                    <div class="about__slider_left">
                        <div class="about__slider_desc">С учетом Ваших пожеланий и отзывов наши мастера постоянно работают над улучшением рецептуры и расширением ассортимента осетинских блюд нашей фабрики пирогов. На сегодняшний день в перечне Вы найдете пироги с разнообразнейшими начинками, выбор которых ограничивается лишь Вашими пожеланиями и кулинарными предпочтениями. Многообразие вариантов начинки позволяет постоянно получать новое уникальное блюдо, как для повседневной, так и для праздничной трапезы.</div>
                    </div>
                    <div class="about__slider_right">
                        Почему пекарня «Всё о пирогах» лучшая в Москве? Потому что именно здесь можно приобрести самые вкусные осетинские пироги. Наши пироги готовятся только вручную, со строгим соблюдением старинных, проверенных временем рецептов, но главное – с душой и теплом, что и придает им неповторимый вкус. Для Вас мы печем наши традиционные пироги как для себя и своих детей. Попробуйте и убедитесь! При необходимости в пекарне Вы можете заказать и ряд других блюд.
                    </div>
                </swiper-slide><swiper-slide>
                    <div class="about__slider_left">
                        <div class="about__slider_desc">С учетом Ваших пожеланий и отзывов наши мастера постоянно работают над улучшением рецептуры и расширением ассортимента осетинских блюд нашей фабрики пирогов. На сегодняшний день в перечне Вы найдете пироги с разнообразнейшими начинками, выбор которых ограничивается лишь Вашими пожеланиями и кулинарными предпочтениями. Многообразие вариантов начинки позволяет постоянно получать новое уникальное блюдо, как для повседневной, так и для праздничной трапезы.</div>
                    </div>
                    <div class="about__slider_right">
                        Почему пекарня «Всё о пирогах» лучшая в Москве? Потому что именно здесь можно приобрести самые вкусные осетинские пироги. Наши пироги готовятся только вручную, со строгим соблюдением старинных, проверенных временем рецептов, но главное – с душой и теплом, что и придает им неповторимый вкус. Для Вас мы печем наши традиционные пироги как для себя и своих детей. Попробуйте и убедитесь! При необходимости в пекарне Вы можете заказать и ряд других блюд.
                    </div>
                </swiper-slide>
                    <div class="swiper-button-prev" slot="button-prev"></div>
                    <div class="swiper-button-next" slot="button-next"></div>
                </swiper>
            </div>
        </div>
        <div class="about__end">
            <div class="about__end_title">Приятного аппетита</div>
        </div>
    </div>
</template>

<script>
  export default {
    metaInfo () {
      return {
        title: 'О нас',
        titleTemplate: '%s | Осетинские пироги',
        meta: [
          {
            name: 'description' ,
            content: 'Пекарня «Всё о пирогах» — это специализированная компания, выпекающая осетинские пироги по традиционной и оригинальной рецептуре, в полном соответствии с современными технологиями и установленными стандартами.'
          },
          {
            name: 'keywords',
            content: 'Пекарня «Всё о пирогах»  выпекающая осетинские пироги по традиционной и оригинальной рецептуре'
          },
        ]
      }
    },
    data() {
      return{
        swiperOption: {
          slidesPerView: 1,
          spaceBetween: 30,
          nextButton: '.swiper-button-next',
          prevButton: '.swiper-button-prev',
        }

      }
    },
    mounted(){
      this.$store.dispatch('loader', { value: false })
    }

  }
</script>